Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: (Yes, this may give fits to the P5-to-P6 translator, but I think it's worth it to separate the concepts.
ja: （はい、これはP6へのP5翻訳者に発作を与えるかもしれない、しかし、私は概念を切り離すことがそれの価値があると思う。

source: Perhaps the symbolic ref form will admit real objects in a pinch.)
ja: おそらく、記号的な参照用紙は、いざという時には実物体を認める。）

source: Hash subscripts and bare keys
ja: ハッシュ添え字と裸のキー

source: There is no hash subscript autoquoting in Perl 6.
ja: Perl 6でautoquotingしているハッシュ添え字が、ない。

source: Use %x&lt;foo&gt; for constant hash subscripts, or the old standby %x'foo'.
ja: 固定ハッシュ添え字または古い待機%x'foo'のために%x&lt;foo&gt;を使いなさい。

source: (It also works to say %x≪foo≫ as long as you realized it's subject to interpolation.)
ja: （それもあなたの長さの%x≪foo≫がそれが展開を受けると理解したと言うために動く。）

source: But =&gt; still autoquotes any bare identifier to its immediate left (horizontal whitespace allowed but not comments).
ja: しかし、=&gt;は、その即時年金への何か裸の識別子が去った（コメントでなく許される横空白文字）autoquotesを静める。

source: The identifier is not subject to keyword or even macro interpretation.
ja: 識別子は、キーワードまたはマクロ字句解釈さえ受けない。

source: then $x ends up containing the pair (&quot;if&quot; =&gt; 1).
ja: そして結局一組(&quot;if&quot; =&gt; 1)を含むことになる｛$x｝。

source: Always.
ja: 常に。

source: (Unlike in Perl 5, where version numbers didn't autoquote.)
ja: （Perl 5のとは異なり、そこでバージョン番号はautoquoteにそうしなかった。）

source: You can also use the :key($value) form to quote the keys of option pairs.
ja: あなたは、オプション一組のキーを引合いに出すために、:key($value)の形を使用することもできる。

source: To align values of option pairs, you may use the &quot;unspace&quot; postfix forms:
ja: オプション組の値を一列に並べるために、あなたは「unspace」接尾辞形を使用するかもしれない：

source: These will be interpreted as
ja: これらは、通訳される

source: Double-underscore forms
ja: 倍のアンダーラインの形態

source: The double-underscore forms are going away:
ja: 倍のアンダーラインの形態は去っている：

source: The =begin finish Pod stream (usually written as just =finish) is special in that it assumes there's no corresponding =end finish before end of file.
ja: それが対応する=end finishがファイル終りの前にないと仮定するという点で、=begin finishポッド流（通常ちょうど=finishとして書かれる）は特別である。

source: Anything in a source file after a =finish is always treated as Pod.
ja: =finishの後のソースファイルの何でも、常にポッドとみなされる。

source: There is no longer any special DATA stream--any Pod block in the current file can be accessed via a Pod object, such as $=data or $=SYNOPSIS or $=UserBlock etc. That is:
ja: もはや少しも特別なDATA流がない－現行ファイルの中の何かポッドブロックはポッドオブジェクト（例えば$=data）によってアクセスされることができる、または、$=SYNOPSISまたは$=UserBlockその他はとても以下の通りである：

source: a variable with the same name of the desired block, and a = twigil.
ja: 望ましいブロックの同じ名前による変数と= twigil。

source: These Pod objects can be used as Positionals (indexed by their block sequence).
ja: これらのポッドオブジェクトが、Positionals（彼らのブロック溶着方法によって索引付けされる）として使われることができる。

source: They can also be treated as Associatives (indexed by :key options specified with the block).
ja: それらは、Associatives（ブロックで指定される:keyオプションによって索引付けされる）とみなされることもできる。

source: Either way, each Positional or Associative element represents the entire contents of the corresponding Pod block.
ja: いずれの方法でも、各々の位置であるか結合要素は、対応するポッドブロックの全コンテンツを表現する。

source: You have to split those contents into lines yourself.
ja: あなたは、自分でそれらの内容を線に分けなければならない。

source: Each chunk has a .range property that indicates its line number range within the source file.
ja: 各々の塊は、ソースファイルの範囲内でその線数値範囲を示す.rangeの資産を持っている。

source: [Speculative] It may also be possible to treat a Pod object as an IO, to read the Pod information line-by-line (like the DATA filehandle in Perl 5, but for any Pod block).
ja: [Speculative] 一行一行ポッド情報を読む（何かポッドブロックを除けば、perl 5の｛データ｝ファイルハンドルのような）ために、ポッドオブジェクトをイオとみなすことは、あり得る場合もある。

source: The lexical routine itself is &amp;?ROUTINE;
ja: 語彙的なルーチンそのものは、&amp;?ROUTINEである;

source: you can get its name with &amp;?ROUTINE.name.
ja: あなたは、&amp;?ROUTINE.nameでその名前を得ることができる。

source: The current block is &amp;?BLOCK.
ja: 現在ブロックは、&amp;?BLOCKである。

source: If the block has any labels, those shows up in &amp;?BLOCK.labels.
ja: ブロックには何かラベルがあるならば、&amp;?BLOCK.labelsで上へそれらのショー。

source: Within the lexical scope of a statement with a label, the label is a pseudo-object representing the dynamically visible instance of that statement.
ja: ラベルによる文のレキシカルスコープの中で、ラベルは、その文のダイナミックに見えるインスタンスを表現している疑似オブジェクトである。

source: (If inside multiple dynamic instances of that statement, the label represents the innermost one.) This is known as lexotic semantics.
ja: これは、lexoticな意味論として知られている（その文の複数のダイナミックなインスタンスの中にあるならば、ラベルは一番奥のものを表現する。）。

source: When you say:
ja: あなたが以下のように言うとき：

source: it is really a method on this pseudo-object, and
ja: それは、本当にこの疑似オブジェクトのメソッドである、そして、

source: would work just as well.
ja: 仕事は、ちょうど同様にそうする。

source: You can exit any labeled block early by saying
ja: あなたは、言うことによって早く、何かラベル付きブロックを出ることができる

source: Heredocs are no longer written with &lt;&lt;, but with an adverb on any other quote construct:
ja: 少しも他の引用構成概念に関する副詞で以外、Heredocsは&lt;&lt;でもはや書かれない：

source: Other adverbs are also allowed, as are multiple heredocs within the same expression:
ja: 他の副詞も許される。そして、そのことは同じ表現の範囲内の複数のheredocsである：

source: Optional whitespace
ja: オプションの空白文字

source: Heredocs allow optional whitespace both before and after terminating delimiter.
ja: Heredocsは、デリミタを終了した前に、そして、それ後にオプションの空白文字を許す。

source: Leading whitespace equivalent to the indentation of the delimiter will be removed from all preceding lines.
ja: デリミタのインデントへの主要な空白文字等価物は、すべての前の線から取り除かれる。

source: If a line is deemed to have less whitespace than the terminator, only whitespace is removed, and a warning may be issued.
ja: 線がターミネータより少ない空白文字を持っていると考えられるならば、空白文字だけは削除される、そして、警告は発されるかもしれない。

source: (Hard tabs will be assumed to align to the next multiple of ($?TABSTOP // 8) spaces, but as long as tabs and spaces are used consistently that doesn't matter.) A null terminating delimiter terminates on the next line consisting only of whitespace, but such a terminator will be assumed to have no indentation.
ja: デリミタを終了しているヌルは空白文字だけから成っている次行で終わる（堅いタブは($?TABSTOP // 8)スペースの次の並列に整列するとされる、しかし、タブとスペースが一貫して使われる限り、それは重要でない。）、しかし、そのようなターミネータはインデントを持たないとされる。

source: (That is, it's assumed to match at the beginning of any whitespace.)
ja: （つまり、それは何か空白文字の始めに合うとされる。）

source: One-pass heredoc parsing
ja: ワンパスheredoc構文解析

source: There are two possible ways to parse heredocs.
ja: 2つのあり得る方法が、heredocsを解析するためにある。

source: One is to look ahead for the newline and grab the lines corresponding to the heredoc, and then parse the rest of the original line.
ja: 人は改行文字の前に見ることになっていて、heredocと一致している線をつかむことになっている、そして、残りの原線を解析しなさい。

source: This is how Perl 5 does it.
ja: これは、Perl 5がそれをする方法である。

source: Unfortunately this suffers from the problem pervasive in Perl 5 of multi-pass parsing, which is masked somewhat because there's no way to hide a newline in Perl 5.
ja: 残念なことに、これはマルチパス構文解析のPerl 5で全面的な問題で苦しむ。そして、方法がPerl 5で改行文字を隠すためにないので、それはいくぶん覆い隠される。

source: In Perl 6, however, we can use &quot;unspace&quot; to hide a newline, which means that an algorithm looking ahead to find the newline must do a full parse (with possible untoward side effects) in order to locate the newline.
ja: しかし、Perl 6では、我々は改行文字を隠すために「unspace」を使うことができる。そして、それは改行文字が改行文字を見つけるために完全な解析（あり得る厄介な副作用で）をしなければならないとわかるために前を見ているその一アルゴリズムを意味する。

source: Instead, Perl 6 takes the one-pass approach, and just lazily queues up the heredocs it finds in a line, and waits until it sees a &quot;real&quot; newline to look for the text and attach it to the appropriate heredoc.
ja: その代わりに、テキストを探して、それを適正heredocに付けることが「本当の」改行文字を見るまで、Perl 6はワンパスアプローチをして、それが線で見つけるheredocsの上でちょうどゆったりと待ち行列を作って、待つ。

source: The downside of this approach is a slight restriction--you may not use the actual text of the heredoc in code that must run before the line finishes parsing.
ja: このアプローチの不利な面はわずかな規制である－線が構文解析を終える前に、走らなければならないコードでheredocの実際のテキストを使わなくてもよい。

source: Mostly that just means you can't write:
ja: 大部分はあなたが書くことができないその正当な手段：

source: You must instead put the entire heredoc into the BEGIN:
ja: あなたは、全てのheredocをBEGINにその代わりに入れなければならない：

source: Version literals
ja: バージョンリテラル

source: A version literal is written with a 'v' followed by the version number in dotted form.
ja: 文字通りの版は、ドットの形でバージョン番号が続く『v』で書かれる。

source: This always constructs a Version object, not a string.
ja: これは、常にVersionオブジェクト（文字列でない）を造る。

source: Only integers and certain wildcards are allowed;
ja: 整数と特定のワイルドカードだけは、許される;

source: for anything fancier you must coerce a string to a Version:
ja: より装飾的な何のためにでも、あなたはVersionに文字列を強制しなければならない：

source: Note though that most places that take a version number in Perl accept it as a named argument, in which case saying :ver&lt;1.2.3beta&gt; is fine.
ja: しかし、Perlでバージョン番号をとる大部分の場所がそれを挙げられた引数と認める点に注意しなさい、その場合には、:ver&lt;1.2.3beta&gt;を言うことはすばらしい。

source: See S11 for more on using versioned modules.
ja: versionedされたモジュールを使用することの詳細について、S11を見なさい。

source: Version objects have a predefined sort order that follows most people's intuition about versioning:
ja: バージョンオブジェクトは、バージョニングについて大部分の人々の直観力に続くあらかじめ定義されたソート順を持つ：

source: each sorting position sorts numerically between numbers, alphabetically between alphas, and alphabetics in a position before numerics.
ja: 数値的に数の間の、アルファベット順にアルファの間の各々の分類位置類いと数字の前の位置のalphabetics。

source: Missing final positions are assumed to be '.0'.
ja: なくなった最終位置は、'.0'であるとされる。

source: Except for '0' itself, numbers ignore leading zeros.
ja: 『0』自体を除いて、数は頭のゼロを無視する。

source: For splitting into sort positions, if any alphabetics (including underscore) are immediately adjacent to a number, a dot is assumed between them.
ja: 並換え位置に分かれるために、何かalphabetics（アンダーラインを含む）がすぐ数に隣接してあるならば、点はそれらの間で装われる。

source: Likewise any non-alphanumeric character is assumed to be equivalent to a dot.
ja: 同様に、何か非英数字文字は、点に等しいとされる。

source: So these are all equivalent:
ja: それで、これらのすべては等しい：

source: And these are also equivalent:
ja: そして、これらも等しい：

source: So these are in sorted version order:
ja: それで、これらはソートされたバージョン順序である：

source: Note how the last pair assume that an implicit .0 sorts after anything alphabetic, and that alphabetic is defined according to Unicode, not just according to ASCII.
ja: 最後の一組がそれを潜在的な.0とみなす方法が何の後ででもソートすることを注意するアルファベットの、まったくアルファベットの、ちょうどASCIIによればでない、定義済みに一致することは、ユニコードにある。

source: The intent of all this is to make sure that prereleases sort before releases.
ja: こんな意図は、リリースの前にそのプレリリースタイプを確かにすることである。

source: Note also that this is still a subset of the versioning schemes seen in the real world.
ja: また、これがまだ、リアルワールドで見られるバージョニングスキームのサブセットである点に注意しなさい。

source: Modules with such strange versions can still be used by Perl since by default Perl imports external modules by exact version number.
ja: デフォルトによってPerlが正確なバージョン番号によって外端モジュールを輸入する時から、そのような変なバージョンによるモジュールがまだPerlによって使われることができる。

source: (See S11.) Only range operations will be compromised by an unknown foreign collation order, such as a system that sorts &quot;delta&quot; before &quot;gamma&quot;.
ja: 測距作業だけは、未知の外国の照合順序（例えば「ガンマ」の前に「デルタ」をソートするシステム）によって危うくされる（S11を見なさい。）。

source: Allomorphic value semantics
ja: Allomorphic値意味論

source: When val() processing is attempted on any list of strings (typically on the individual words within angle brackets), the function attempts to determine if the intent of the programmer or user might have been to provide a numeric value.
ja: val()処理が文字列（概してかぎ括弧の範囲内の個々のワードの上で）の何かリストで試みられるとき、関数はプログラマーかユーザーの意図が数値を提供することになっていたかもしれないかどうかについて決定しようとする。

source: For any item in the list that appears to be numeric, the literal is stored as an object with both a string and a numeric nature, where the string nature always returns the original string.
ja: 数であるように見えるリストの何かアイテムのために、リテラルは文字列と数の自然によるオブジェクトとして保存される、そこで、文字列自然は常に元の文字列を返る。

source: This is implemented via multiple inheritance, to truly represent the allomorphic nature of a literal value that has not committed to which type the user intends.
ja: 本当に、ユーザーがどの型を意図するかについて、専念しなかったリテラル値のallomorphicな性質を表現するために、これは多重継承を通して実装される。

source: The numeric type chosen depends on the appearance of the literal.
ja: 選ばれる数値型は、文字通りのものの様子次第である。

source: produces objects of classes defined as:
ja: 定義されるクラスのオブジェクトを生じる：

source: One purpose of this is to facilitate compile-time analysis of multi-method dispatch, when the user prefers angle notation as the most readable way to represent a list of numbers, which it often is.
ja: ユーザーが最も読み込み可能な方法としての角度表記法が数（それはしばしばそうである）のリストを表現するのを好むとき、これの1つの目的はマルチメソッドディスパッチのコンパイル時分析を容易にすることである。

source: Due to the MI semantics, the new object is equally a string and a number, and can be bound as-is to either a string or a numeric parameter.
ja: MI意味論のために、新しいオブジェクトは等しく文字列と数で、現状のままで文字列か数値パラメーターの束縛を受けることがありえる。

source: In case multiple dispatch determines that it could dispatch as either string or number, a tie results, which may result in an ambiguous dispatch error.
ja: 複数のディスパッチがそれがどちらの文字列または数としてでも指名することができたと決定する場合に備えて、タイは起こる。そして、それは結果としてあいまいなディスパッチエラーになるかもしれない。

source: You'll need to use prefix + or ~ on the argument to resolve the ambiguity in that case.
ja: あなたは、その場合曖昧さを分解するために引数の上で接頭辞+または~を使う必要がある。

source: [Conjecture: we may someday find a way to make strings bind a little looser than the numeric types, but for now we conservatively outlaw the dispatch as ambiguous, and watch how this plays out in use.]
ja: ［推測する：我々は方法が文字列苦境を数値型より少し不安定にするといつかわかるかもしれない、しかし、今のところ、あいまいであるように、我々は保守的にディスパッチを非合法化して、これがどのように使用中に尽きるかについて見る。］

source: The allomorphic behavior of angle brackets is not a special case;
ja: かぎ括弧のallomorphicな作用は、特例でない;

source: it's actually an example of a more general process of figuring out type information by parsing text that comes from any situation where the user is forced to enter text when they really mean other kinds of values.
ja: それは、実は、それらが他の種類の値を本当に意味するとき、ユーザーがテキストを入力することを強制される何か状況から来るテキストを解析することによって型情報を理解するより一般的なプロセスの例である。

source: A function prompting the user for a single value might usefully pass the result through val() to intuit the proper type.
ja: 一つの値のためにユーザーを促している関数は、適当な型を直観するために、結果をval()に有効に通すかもしれない。

source: The angle form with a single value serves as the literal form of numbers such as Rat and Complex that would otherwise have to be constructed via constant folding.
ja: 一つの値による角度の形態は、数（例えばさもなければ定数畳込みを通して造られなければならないRatとComplex）の文字通りの形として用いられる。

source: It also gives us a reasonable way of visually isolating any known literal format as a single syntactic unit:
ja: それも、我々に一つの構文法の単位として何か既知の文字通りのフォーマットを視覚的に孤立させることの合理的な方法を与える：

source: Any such literal, when written without spaces, produces a pure numeric value without a stringy allomorphism.
ja: スペースなしで書かれるとき、そのようなリテラルは繊維質の異形症なしで純粋な数値を生じる。

source: Put spaces to override that:
ja: 置かれたスペースは、以下にオーバーライドすることになっている

source: Or use the ≪≫ form of quotewords, which is always allomorphic:
ja: あるいは、quotewords（常にallomorphicである）の≪≫の形を使用する：

source: Allomorphic Rats
ja: Allomorphicネズミ

source: Any rational literal that would overflow a Rat64 in the denominator is also stored as a string.
ja: 分母でRat64からあふれ出る何か合理的なリテラルは、文字列としても保存される。

source: (That is, angle brackets will be assumed in this case, producing a RatStr.) If a coercion to a wider type, such as FatRat, is requested, the literal reconverts from the entire original string, rather than just the value that would fit into a Rat64.
ja: より広い型（例えばFatRat）への強制が要請されるならば、文字通りのものは全元の文字列（ちょうどRat64に適合する値よりもむしろ）から復帰する（つまり、かぎ括弧はこの場合装われる。そして、RatStrを生じる。）。

source: (It may then cache that converted value for next time, of course.) So if you declare a constant with excess precision, it does not automatically become a FatRat, which would force all calculations into the pessimal FatRat type.
ja: そう、あなたが過剰な精度で定数を宣言するならば、それは自動的にFatRatにならない（それから、もちろん、それは次の時間のためにその変換値をたくわえるかもしれない。）。そして、それはすべての計算にpessimalなFatRat型を強いる。

source: Context
ja: 前後関係

source: * Perl still has the three main contexts:
ja: * Perlには、まだ3つの主要な前後関係がある：

source: sink (aka void), item (aka scalar), and list.
ja: シンク（別名無効な）、アイテム（別名段階的な）とリスト。

source: * In addition to undifferentiated items, we also have these item contexts:
ja: * 未分化アイテムに加えて、我々にもこれらのアイテム前後関係がある：

source: There are also various container contexts that require particular kinds of containers (such as slice and hash context;
ja: 特定の種類のコンテナを必要とするいろいろなコンテナ前後関係も、ある（前後関係をスライスして、ハッシュするようであるもの;

source: see S03 for details).
ja: 詳細はS03を見なさい）。

source: * Unlike in Perl 5, objects are no longer always considered true.
ja: * Perl 5のとは異なり、オブジェクトは真実であるともはや必ずしも考えられない。

source: It depends on the state of their .Bool method, which may either be a synthetic attribute or an explicitly represented bit in the object.
ja: それは彼らの.Boolメソッドの国次第である。そして、それは合成属性またはオブジェクトのはっきりと表現されたビットである場合もある。

source: Classes get to decide which of their values are true and which are false.
ja: クラスは、彼らの値のうちどちらが真実か、そして、どちらが間違っているか決定するようになる。

source: Individual objects can override the class definition:
ja: 個々のオブジェクトは、クラス定義にオーバーライドすることができる：

source: This overrides the .Bool method of the 0 without changing its official type (by mixing the method into an anonymous derived type).
ja: これは、その公式型（メソッドを匿名の派生型に混入することによって）を変えることなく、0の.Boolメソッドにオーバーライドする。

source: * The definition of .Bool for the most ancestral type (that is, the Mu
ja: * 最も多くの祖先型のための.Boolの定義（つまり、Mu

source: type) is equivalent to .defined.
ja: type) .definedに等しい。

source: Since type objects are considered undefined, all type objects (including Mu itself) are false unless the type overrides the definition of .Bool to include undefined values.
ja: 型オブジェクトが未定義であると考えられるので、型が未定義値を含むために.Boolの定義にオーバーライドしない限り、すべての型オブジェクト（Mu自体を含む）は間違っている。

source: Instantiated objects default to true unless the class overrides the definition.
ja: クラスが定義にオーバーライドしない限り、具体例をあげて示されたオブジェクトは真にデフォルトでなる。

source: Note that if you could instantiate a Mu it would be considered defined, and thus true.
ja: あなたがMuを具体例をあげて示すことができるならば、それが定義されて、このように真実であると考えられるだろうことに注意すべきである。

source: (It is not clear that this is allowed, however.)
ja: （しかし、これが許されることは明白でない。）

source: * In general any container types should return false if they are empty, and true otherwise.
ja: * 一般に、それらが空で、さもなければ真実であるならば、何かコンテナ型は誤って返らなければならない。

source: This is true of all the standard container types except Scalar, which always defers the definition of truth to its contents.
ja: これはスカラー以外はすべての標準的なコンテナ型にとって真実である。そして、それは常に真実の定義をその内容に延期する。

source: Non-container types define truthiness much as Perl 5 does.
ja: Perl 5がそうして、非コンテナ型はtruthinessを非常に定義する。

source: Just as with the standard types, user-defined types should feel free to partition their defined values into true and false values if such a partition makes sense in control flow using boolean contexts, since the separate .defined method is always there if you need it.
ja: ちょうど標準型と同様に、あなたがそれを必要とするならば別々の.definedメソッドが常にそこにある時から、そのような分割がブール値コンテキストを用いた制御フローで意味をなすならば、利用者定義型は彼らの定義済み値を本当で間違った値に仕切るのを遠慮しなくなければならない。

source: Lists
ja: リスト

source: Lazy flattening
ja: 怠惰な平坦化

source: List context in Perl 6 is by default lazy.
ja: Perl 6のリストコンテキストは、デフォルトで怠惰である。

source: This means a list can contain infinite generators without blowing up.
ja: リストがそうすることができるこの手段は、爆発することなく、無限の発電機を含む。

source: No flattening happens to a lazy list until it is bound to the signature of a function or method at call time (and maybe not even then).
ja: それが呼び出し時間（そして、多分均一でないそれから）に関数またはメソッドのシグネチャの束縛を受けるだろうまで、平坦化は怠惰なリストに起こらない。

source: We say that such an argument list is &quot;lazily flattened&quot;, meaning that we promise to flatten the list on demand, but not before.
ja: 要求に応じてリストを平らにすると約束することを意味して、我々はそのような引数の並びが「ゆったりと平らにされる」と言う、しかし、それまではだめ。

source: list, flat, item, and .tree
ja: list、flat、itemと.tree

source: There is a &quot;list&quot; operator which imposes a list context on its arguments even if list itself occurs in a item context.
ja: たとえlist自体がアイテム前後関係で起こるとしても、リストコンテキストをその引数に強要する&quot;list&quot;演算子が、ある。

source: To force explicit flattening, use the flat contextualizer.
ja: 明示的平坦化を強制するために、flat contextualizerを使いなさい。

source: This recursively flattens all parcels into a 1-dimensional list.
ja: これは、1次元リストにすべてのパーセルを再帰的に平らにする。

source: When bound to a slurpy parameter, a capture flattens the rest of its positional arguments.
ja: slurpyパラメータに密接に結びつくとき、キャプチャーは残りのその位置引数を平らにする。

source: To reform a list so that sub-parcels turn into tree nodes, use the .tree method, which is essentially a level-sensitive map, with one closure provided for remapping the parcels at each level:
ja: 下位パーセルがツリーノードに変わるように、リストを改革するために、1つのクロージャを各々のレベルでパーセルを再配置するために提供して、.treeメソッド（それは基本的にレベルセンシティブmapである）を使用しなさい：

source: When bound to a slice parameter (indicated with **), a capture reforms the rest of its positional arguments with one level of &quot;treeness&quot;, equivalent to @args.tree(1), that is, a list of lists, or LoL.
ja: スライスパラメータ（**で示される）に密接に結びつくとき、キャプチャーは1レベルのtreenessで残りのその位置引数を改革する。そして、@args.tree(1)（つまり、リストのリストまたはLoL）に等しい。

source: The sublists are not automatically flattened;
ja: サブリストは、自動的に平らにされない;

source: that is, if a sublist is a Parcel, it remains a list until subsequent processing decides how flat or treelike the sublist should be.
ja: つまり、サブリストがParcelであるならば、以降の処理がサブリストがどれくらい平らでなければならないかtreelikeでなければならないかについて決めるまで、それはリストのままである。

source: To force a non-flattening item context, use the &quot;item&quot; operator.
ja: 非平らになっているアイテム前後関係を強制するために、&quot;item&quot;演算子を使いなさい。

source: Forcing capture context
ja: 強制キャプチャー前後関係

source: The | prefix operator may be used to force &quot;capture&quot; context on its argument and also defeat any scalar argument checking imposed by subroutine signature declarations.
ja: |前置演算子は、その引数の上にキャプチャー前後関係を押しつけて、そのうえサブルーチンシグネチャ宣言によって課されてチェックしている何かスカラー引数を破るのに用いられるかもしれない。

source: Any resulting list arguments are then evaluated lazily.
ja: それから、何か結果として生じるリスト引数は、ゆったりと評価される。

source: The eager operator
ja: eager演算子

source: To force non-lazy list processing, use the eager list operator.
ja: 非怠惰なリスト処理を強制するために、eagerリスト演算子を使用しなさい。

source: List assignment is also implicitly eager.
ja: リスト割当ても、暗黙のうちに熱心である。

source: (Actually, when we say &quot;eager&quot; we usually mean &quot;mostly eager&quot; as defined in S07).
ja: （実は、「熱心な」言うとき、我々はS07で定義されるように、「大部分は熱心な」通常言っている）。

source: By contrast,
ja: 対照的に、

source: makes no guarantee about how many lines ahead the iterator has read.
ja: 反復子が前にどれくらいの線を読み込んだかについて、保証を作らない。

source: Iterators feeding a list are allowed to process in batches, even when stored within an array.
ja: 配列の中で格納されるときでも、リストを供給している反復子はバッチでプロセスまで許される。

source: The array knows that it is extensible, and calls the iterator as it needs more elements.
ja: 配列は、それが伸長可能で、より多くの要素を必要として反復子を呼ぶということを知っている。

source: (Counting the elements in the array will also force eager completion.)
ja: （配列で要素を数えることは熱心な完成も強制する。）

source: This operator is agnostic towards flattening or slicing.
ja: この演算子は、平らになるか、切る方へ不可知論者である。

source: In merely changes the work-ahead policy for the value generator.
ja: 値発生器のための仕事前進方針は、単に変わる。

source: The hyper operator
ja: hyper演算子

source: A variant of eager is the hyper list operator, which declares not only that you want all the values generated now, but that you want them badly enough that you don't care what order they're generated in, as long as the results come back in the right order.
ja: eagerの変形はhyperリスト演算子である。そして、もしあなたがそれらをあなたがそれらがどんな順序で発生するかについて気にしないひどく十分にしてもらいたくなければ、それは結果が右整環で戻る限りあなたがすべての値が現在発生することを望むことを除いてはでなく、宣言する。

source: That is, eager requires sequential evaluation of the list, while hyper requests (but does not require) parallel evaluation.
ja: つまり、hyperが（しかし、requireをしない）平行した評価を要請する間、eagerはリストのシーケンシャルな評価を必要とする。

source: In any case, it declares that you don't care about the evaluation order, only the result order.
ja: いずれにせよ、それは、あなたは評価順序（結果順序だけ）が好きでないと断言する。

source: It merely changes the work-ahead policy for the value generator.
ja: それは、単に仕事前進方針を値発生器と交換するだけである。

source: The race operator
ja: race演算子
